
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/19543067444)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * oci_core_subnet.my_vcn_subnet


<details><summary>Change Result (Click me)</summary>

```hcl

  # oci_core_subnet.my_vcn_subnet will be created
  + resource "oci_core_subnet" "my_vcn_subnet" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.21.0/24"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaa3vcsovo36fpa7kf42sljmsypxgwrp37lowwl27g5n7pgy765krba"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "my_vcn_subnet__prod"
      + dns_label                  = "prod"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv4cidr_blocks            = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = "ocid1.vcn.oc1.ap-osaka-1.amaaaaaamrimpjaanurgxz6y3nd2clqodgdejordf7dtcaqrr6slh6e7sngq"
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Attribute Deprecated

  with cloudflare_pages_project.homepage,
  on my_homepage.tf line 1, in resource "cloudflare_pages_project" "homepage":
   1: resource "cloudflare_pages_project" "homepage" {

All new projects now use the Standard usage model.

(and one more similar warning elsewhere)
```

</details>



## :warning: Warnings

```hcl
Warning: Attribute Deprecated

  with cloudflare_pages_project.homepage,
  on my_homepage.tf line 1, in resource "cloudflare_pages_project" "homepage":
   1: resource "cloudflare_pages_project" "homepage" {

All new projects now use the Standard usage model.

(and one more similar warning elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":177,"Program":"tfcmt","SHA1":"5ac8b578ac9105b18d40f14ce3617bc91cad8a01","Vars":{},"WorkflowName":"Terraform CI"} -->